Autodesk.Navisworks.Api.Plugins.RibbonLayoutAttribute
Defines a new ribbon layout in the GUI system

Autodesk.Navisworks.Api.Plugins.RibbonLayoutAttribute.#ctor(System.String)
Constructor
xaml:
The Xaml file that specifies the Ribbon tab

Autodesk.Navisworks.Api.Plugins.RibbonLayoutAttribute.Xaml
The Xaml file that specifies the Ribbon tab and commands